demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.75/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    
    omega
    {
        $U;
        tolerance       1e-15; 
    }


}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    residualControl
    {
        "(U|p|k)"       5e-7;
        omega           1e-10;
    }
    consistent          yes;
}

relaxationFactors
{

    equations
    {
        U               0.9;
        k               0.7;
        omega           0.7;
    }
}


// ************************************************************************* //
