demo-output/website/dafoam/f6a_epistemic_band/r4_band_tightening_hump/oneC_delta0.75/system/gradU
gradU
{     
// Mandatory entries     
type            grad;     
libs            ("libfieldFunctionObjects.so");     
field           U;     

// Optional (inherited) entries     
result          gradU;     
}
